Repository: collective/getpaid.removalsales
Catalog: getpaid/removalsales/locales/*/LC_MESSAGES/getpaid.removalsales.po
Languages: fi

source: Authorize Sale
fi: Vahvista kauppa

source: Authorize sale on completion.
fi: Vahvista kauppa suorituksen yhteydessä

source: Back
fi: Paluu

source: Cancel
fi: Peruuta

source: Make Removal
fi: Suorita poisto

source: Mark As Delivered
fi: Merkitse toimitetuksi

source: Mark sales as delivered on completion.
fi: Merkitse kauppa toimitetuksi suorituksen yhteydessä.

source: Removal Sales
fi: Poistomyynti

source: This is removal sales payment. No monetary transactions are performed.
fi: Tämä on poistomyynti. Mitään maksua ei suoriteta.

source: This payment method is used for removing items from store leaving a sales record. No monetary transactions are performed.
fi: Poistomyyntiä käytetään tuotteiden poistoon varastosta jättäen merkintä tapahtumasta. Mitään maksua ei suoriteta.
